app/Controllers/AuthController.php

SELECT *
FROM `usuarios`
WHERE `email` = 'sulla@gmail.com'
 LIMIT 1
---
    public function auth()
    {
        $model = new UsuarioModel();

        $email = $this->request->getPost('email');
        $senha = $this->request->getPost('senha');

        $usuario = $model->where('email', $email)->first();