app/Controllers/PostController.php

    public function index()
    {
        $postModel = new PostagemModel();
        $likeModel = new LikeModel();
        $comentarioModel = new ComentarioModel();

        $posts = $postModel->getPosts();

        foreach ($posts as &$post) {

            $post['likes'] = $likeModel
                ->where('postagem_id', $post['id'])
                ->countAllResults();

            $post['curtiu'] = $likeModel
                ->where('postagem_id', $post['id'])
                ->where('usuario_id', session()->get('usuario_id'))
                ->first() ? true : false;

            $post['comentarios'] = $comentarioModel
                ->select('comentarios.*, usuarios.nome')
                ->join('usuarios', 'usuarios.id = comentarios.usuario_id')
                ->where('postagem_id', $post['id'])
                ->orderBy('comentarios.id', 'ASC')
                ->findAll();
        }

        $usuarioModel = new UsuarioModel();
        $sugestoes = $usuarioModel
            ->where('id !=', session()->get('usuario_id'))
            ->orderBy('id', 'RANDOM')
            ->findAll(3);
---
SELECT COUNT(*) AS `numrows`
FROM `likes`
WHERE `postagem_id` = '15'
SELECT *
FROM `likes`
WHERE `postagem_id` = '15'
AND `usuario_id` = '5'
 LIMIT 1
SELECT `comentarios`.*, `usuarios`.`nome`
FROM `comentarios`
JOIN `usuarios` ON `usuarios`.`id` = `comentarios`.`usuario_id`
WHERE `postagem_id` = '15'
ORDER BY `comentarios`.`id` ASC
SELECT *
FROM `usuarios`
WHERE `id` != '5'
ORDER BY RAND()
 LIMIT 3

    public function like($postId)
    {
        $likeModel = new LikeModel();
        $usuarioId = session()->get('usuario_id');

        $existe = $likeModel
            ->where('usuario_id', $usuarioId)
            ->where('postagem_id', $postId)
            ->first();

        if (!$existe) {
            $likeModel->save([
                'usuario_id' => $usuarioId,
                'postagem_id' => $postId
            ]);
---
SELECT *
FROM `likes`
WHERE `usuario_id` = '6'
AND `postagem_id` = '2'
 LIMIT 1
INSERT INTO `likes` (`usuario_id`, `postagem_id`) VALUES ('6', '2')