app/Controllers/UserController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '6'
SELECT COUNT(*) AS `numrows`
FROM `likes`
WHERE `postagem_id` = '15'
SELECT *
FROM `likes`
WHERE `postagem_id` = '15'
AND `usuario_id` = '6'
 LIMIT 1
SELECT `comentarios`.*, `usuarios`.`nome`
FROM `comentarios`
JOIN `usuarios` ON `usuarios`.`id` = `comentarios`.`usuario_id`
WHERE `postagem_id` = '15'
ORDER BY `comentarios`.`id` ASC
---
    public function meuPerfil()
    {
        $userId = session()->get('usuario_id');

        if (!$userId) {
            return redirect()->to('/login');
        }

        $usuarioModel = new UsuarioModel();
        $postModel = new PostagemModel();
        $seguidorModel = new SeguidorModel();

        $usuario = $usuarioModel->find($userId);

        $likeModel = new LikeModel();
        $comentarioModel = new ComentarioModel();

        $posts = $postModel
            ->where('usuario_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->findAll();

        foreach ($posts as &$post) {
            $post['nome'] = $usuario['nome']; // for view consistency

            $post['likes'] = $likeModel
                ->where('postagem_id', $post['id'])
                ->countAllResults();

            $post['curtiu'] = $likeModel
                ->where('postagem_id', $post['id'])
                ->where('usuario_id', $userId)
                ->first() ? true : false;

            $post['comentarios'] = $comentarioModel
                ->select('comentarios.*, usuarios.nome')
                ->join('usuarios', 'usuarios.id = comentarios.usuario_id')
                ->where('postagem_id', $post['id'])
                ->orderBy('comentarios.id', 'ASC')
                ->findAll();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '6'
SELECT COUNT(*) AS `numrows`
FROM `likes`
WHERE `postagem_id` = '15'
SELECT *
FROM `likes`
WHERE `postagem_id` = '15'
AND `usuario_id` = '5'
 LIMIT 1
SELECT `comentarios`.*, `usuarios`.`nome`
FROM `comentarios`
JOIN `usuarios` ON `usuarios`.`id` = `comentarios`.`usuario_id`
WHERE `postagem_id` = '15'
ORDER BY `comentarios`.`id` ASC
---
    public function perfil($id)
    {
        $usuarioModel = new UsuarioModel();
        $postModel = new PostagemModel();
        $seguidorModel = new SeguidorModel();

        $usuario = $usuarioModel->find($id);

        $likeModel = new LikeModel();
        $comentarioModel = new ComentarioModel();

        $posts = $postModel
            ->where('usuario_id', $id)
            ->orderBy('created_at', 'DESC')
            ->findAll();

        $meuId = session()->get('usuario_id');

        foreach ($posts as &$post) {
            $post['nome'] = $usuario['nome']; // for view consistency

            $post['likes'] = $likeModel
                ->where('postagem_id', $post['id'])
                ->countAllResults();

            $post['curtiu'] = $likeModel
                ->where('postagem_id', $post['id'])
                ->where('usuario_id', $meuId)
                ->first() ? true : false;

            $post['comentarios'] = $comentarioModel
                ->select('comentarios.*, usuarios.nome')
                ->join('usuarios', 'usuarios.id = comentarios.usuario_id')
                ->where('postagem_id', $post['id'])
                ->orderBy('comentarios.id', 'ASC')
                ->findAll();