app/Controllers/UserController.php

    public function perfil($id)
    {
        $usuarioModel = new UsuarioModel();
        $postModel = new PostagemModel();
        $seguidorModel = new SeguidorModel();

        $usuario = $usuarioModel->find($id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '6'