app/Models/PostagemModel.php

    public function getPosts()
    {
        return $this->select('postagens.*, usuarios.nome')
            ->join('usuarios', 'usuarios.id = postagens.usuario_id')
            ->orderBy('postagens.created_at', 'DESC')
            ->findAll();
---
SELECT `postagens`.*, `usuarios`.`nome`
FROM `postagens`
JOIN `usuarios` ON `usuarios`.`id` = `postagens`.`usuario_id`
ORDER BY `postagens`.`created_at` DESC